/*
Navicat MySQL Data Transfer

Source Server         : 192.168.1.250
Source Server Version : 50538
Source Host           : 192.168.1.250:3306
Source Database       : demo-ds1

Target Server Type    : MYSQL
Target Server Version : 50538
File Encoding         : 65001

Date: 2018-01-08 13:20:51
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `basics_duties`
-- ----------------------------
DROP TABLE IF EXISTS `basics_duties`;
CREATE TABLE `basics_duties` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `sort_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL COMMENT '同一机构不能重复',
  `is_disable` bit(1) NOT NULL,
  `remark` text,
  `gmt_create` datetime NOT NULL,
  `gmt_modified` datetime NOT NULL,
  `is_delete` bit(1) NOT NULL,
  `gmt_delete` datetime DEFAULT NULL,
  `organization_id` bigint(20) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `IX_B_Duties_Name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of basics_duties
-- ----------------------------
INSERT INTO `basics_duties` VALUES ('1', '2', '经理', '', '管理', '2017-11-03 10:37:09', '2017-11-03 10:37:09', '', '2017-12-05 17:18:12', '1');
INSERT INTO `basics_duties` VALUES ('2', '0', 'Jackson', '', '项目经理666', '2017-11-03 16:13:10', '2017-12-05 17:19:14', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('3', '2', 'Jordan1', '', '管理', '2017-11-03 18:20:24', '2017-11-03 18:20:24', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('4', '2', 'Jordan11', '', '管理', '2017-11-04 19:53:25', '2017-11-04 19:53:25', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('5', '0', '大佬', '', '', '2017-11-08 14:54:31', '2017-11-08 14:54:31', '', '2017-11-08 14:57:04', '1');
INSERT INTO `basics_duties` VALUES ('6', '0', '小弟', '', '', '2017-11-08 14:54:46', '2017-11-08 14:54:46', '', '2017-11-08 14:54:51', '1');
INSERT INTO `basics_duties` VALUES ('7', '0', '职务1', '', '是范德萨', '2017-11-09 16:31:55', '2017-11-13 20:24:14', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('8', '0', '测试', '', '', '2017-11-17 10:07:17', '2017-11-17 10:07:17', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('9', '0', '市场01', '', '014', '2017-11-17 14:54:45', '2017-11-17 14:57:07', '', '2017-11-17 14:57:43', '1');
INSERT INTO `basics_duties` VALUES ('10', '0', '23232', '', '', '2017-11-18 15:25:15', '2017-11-18 15:25:15', '', '2017-12-07 19:21:13', '1');
INSERT INTO `basics_duties` VALUES ('11', '0', '测试经理', '', '', '2017-11-20 17:08:48', '2017-11-20 17:08:48', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('12', '0', 'f55dcf8d-06f6-4', '', '', '2017-12-04 13:02:12', '2017-12-04 13:02:12', '', '2017-12-07 19:20:37', '1');
INSERT INTO `basics_duties` VALUES ('13', '0', '41d9fe9d-8d72-4', '', '', '2017-12-04 13:02:17', '2017-12-04 13:02:17', '', '2017-12-07 19:20:40', '1');
INSERT INTO `basics_duties` VALUES ('14', '0', 'fa761c51-4f29-4', '', '', '2017-12-04 13:02:19', '2017-12-04 13:02:19', '', '2017-12-07 19:20:44', '1');
INSERT INTO `basics_duties` VALUES ('15', '0', '111', '', '', '2017-12-05 14:59:54', '2017-12-05 14:59:54', '', '2017-12-07 19:20:48', '1');
INSERT INTO `basics_duties` VALUES ('16', '2', 'CTO', '', 'CTO', '2017-12-05 17:03:17', '2017-12-05 17:03:17', '', '0000-00-00 00:00:00', '1');
INSERT INTO `basics_duties` VALUES ('17', '0', '121', '', '21312321', '2017-12-07 15:10:38', '2017-12-07 15:10:48', '', '2017-12-07 15:10:51', '1');
INSERT INTO `basics_duties` VALUES ('18', '0', '2323``', '', '', '2017-12-19 13:29:39', '2017-12-19 13:29:49', '', '2017-12-19 13:29:59', '1');

-- ----------------------------
-- Table structure for `basics_nation`
-- ----------------------------
DROP TABLE IF EXISTS `basics_nation`;
CREATE TABLE `basics_nation` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `sort_id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `is_disable` bit(1) NOT NULL,
  `remark` text,
  `gmt_create` datetime NOT NULL,
  `gmt_modified` datetime NOT NULL,
  `is_delete` bit(1) NOT NULL,
  `gmt_delete` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `IX_B_Nation_Name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of basics_nation
-- ----------------------------
INSERT INTO `basics_nation` VALUES ('14', '14', '白族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('15', '15', '土家族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('16', '16', '哈尼族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('17', '17', '哈萨克族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('18', '18', '傣族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('19', '19', '黎族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('20', '20', '傈傈族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('21', '21', '佤族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('22', '22', '畲族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('23', '23', '高山族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('24', '24', '拉祜族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('25', '25', '水族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('26', '26', '东乡族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('27', '27', '纳西族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('28', '28', '景颇族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('29', '29', '柯尔克孜', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('30', '30', '土族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('31', '31', '达斡尔族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('32', '32', '仫佬族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('33', '33', '羌族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('34', '34', '布朗族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('35', '35', '撒拉族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('36', '36', '毛难族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('37', '37', '仡佬族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('38', '38', '锡伯族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('39', '39', '阿昌族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('40', '40', '普米族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('41', '41', '塔吉克族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('42', '42', '怒族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('43', '43', '乌孜别克', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('44', '44', '俄罗斯族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('45', '45', '鄂温克族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('46', '46', '崩龙族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('47', '47', '保安族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('48', '48', '裕固族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('49', '49', '京族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('50', '50', '塔塔尔族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('51', '51', '独龙族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('52', '52', '鄂伦春族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('53', '53', '赫哲族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('54', '54', '门巴族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('55', '55', '珞巴族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
INSERT INTO `basics_nation` VALUES ('56', '56', '基诺族', '', '', '2017-12-07 10:34:52', '2017-12-07 10:34:52', '', '0000-00-00 00:00:00');
